package Day01_to_Day21.Day15;

public class Day15_3 {
	
	public static void main(String[] args) {
		
		// 주차 현황 프로그램 설계
			// 1. 파일 구분
				// M : 모델	( 데이터 / 정보	)
				// C : 커트롤 ( 이벤트   작동	)
				// V : 입출력	( 사용자 화면	)
		
			// 2. 모델 선택
				// 1. 자동차클래스 
					// 클래스 설계 [ 필드 / 생성자 / 메소드 [ set, get ] ]
						// 영구 기록 : 차량 번호, 입차 시간, 출차 시간
						// 계산용 : 날짜 금액
			// 3. 이벤트 선택 
				// 1. 입차 2. 출차
					// 입차 메소드 
					// 출차 메소드
				// 메소드 : static 사용금지 
			//
				
				
		
		
	}
}
